# Pandas

panda is a library where we do data anaylsis .

The uses of pandas is:
For to import data set.
use for data wrangling.

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\karth\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\karth\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\karth\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\karth\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\karth\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\karth\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [7]:
data1={"Name":["Karthikeya","Goutam","Sudhakar"],
      "Age":[18,20,53],
      "Gender":["male","male","male"]
}

In [9]:
data1

{'Name': ['Karthikeya', 'Goutam', 'Sudhakar'],
 'Age': [18, 20, 53],
 'Gender': ['male', 'male', 'male']}

In [11]:
type(data1)

dict

In [13]:
df=pd.DataFrame(data=data1)

In [14]:
df

         Name  Age Gender
0  Karthikeya   18   male
1      Goutam   20   male
2    Sudhakar   53   male

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
n=df["Name"]

In [17]:
n

0    Karthikeya
1        Goutam
2      Sudhakar
Name: Name, dtype: object

In [18]:
df["Age"]

0    18
1    20
2    53
Name: Age, dtype: int64

In [19]:
type(n)

pandas.core.series.Series

In [20]:
df["Gender"]

0    male
1    male
2    male
Name: Gender, dtype: object

In [23]:
li=[100,223,323,44,52]

In [24]:
pd.Series(data=li)

0    100
1    223
2    323
3     44
4     52
dtype: int64

In [25]:
df

         Name  Age Gender
0  Karthikeya   18   male
1      Goutam   20   male
2    Sudhakar   53   male

In [26]:
df["Name"]

0    Karthikeya
1        Goutam
2      Sudhakar
Name: Name, dtype: object

In [27]:
pd.Series([22,23,50],name="Age")

0    22
1    23
2    50
Name: Age, dtype: int64

In [28]:
df

         Name  Age Gender
0  Karthikeya   18   male
1      Goutam   20   male
2    Sudhakar   53   male

In [32]:
df['Age'].max()

53

In [33]:
df['Age'].min()

18

In [34]:
df.describe()

             Age
count   3.000000
mean   30.333333
std    19.655364
min    18.000000
25%    19.000000
50%    20.000000
75%    36.500000
max    53.000000

In [35]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]


brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [36]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [37]:
brics.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [44]:
brics["area"]

0     8.516
1    17.100
2     3.286
3     9.670
4     2.980
Name: area, dtype: float64

In [45]:
brics["population"]

0     200.4
1     143.5
2    1252.0
3     133.0
4       4.3
Name: population, dtype: float64

In [46]:
brics["capital"]

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: capital, dtype: object

In [47]:
brics["country"]

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: country, dtype: object

In [40]:
brics["area"].min()

2.98

In [41]:
brics["population"].min()

4.3

In [42]:
brics["area"].max()

17.1

In [43]:
brics["population"].max()

1252.0

In [50]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [51]:
brics.shape

(5, 4)

In [53]:
df

         Name  Age Gender
0  Karthikeya   18   male
1      Goutam   20   male
2    Sudhakar   53   male

In [54]:
df.shape

(3, 3)

In [56]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [57]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [59]:
brics.index=['A','B','C','D','E']

In [61]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [68]:
brics.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [70]:
brics.index=range(1,10,2)

In [71]:
brics

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [72]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [73]:
brics.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [74]:
brics.country

1          Brazil
3          Russia
5           India
7           China
9    South Africa
Name: country, dtype: object

In [75]:
brics["country"]

1          Brazil
3          Russia
5           India
7           China
9    South Africa
Name: country, dtype: object

In [80]:
brics.area.min()

2.98

In [107]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]


brics=pd.DataFrame(data={'country': country, 
                  'capital': capital,
                  'area': area,
                  'population': population})

In [108]:
brics.index=['A','B','C','D','E']

In [109]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [110]:
brics.reset_index()

  index       country    capital    area  population
0     A        Brazil   Brasilia   8.516       200.4
1     B        Russia     Moscow  17.100       143.5
2     C         India  New Delhi   3.286      1252.0
3     D         China    Beijing   9.670       133.0
4     E  South Africa   Pretoria   2.980         4.3

In [111]:
brics

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [112]:
brics.reset_index(inplace=True)

In [113]:
brics

  index       country    capital    area  population
0     A        Brazil   Brasilia   8.516       200.4
1     B        Russia     Moscow  17.100       143.5
2     C         India  New Delhi   3.286      1252.0
3     D         China    Beijing   9.670       133.0
4     E  South Africa   Pretoria   2.980         4.3

In [114]:
brics.reset_index()

   level_0 index       country    capital    area  population
0        0     A        Brazil   Brasilia   8.516       200.4
1        1     B        Russia     Moscow  17.100       143.5
2        2     C         India  New Delhi   3.286      1252.0
3        3     D         China    Beijing   9.670       133.0
4        4     E  South Africa   Pretoria   2.980         4.3